result/wrk11-1593368338.txt
Running 1m test @ http://192.168.1.4/index.html
  4 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   492.63us  585.08us   8.50ms   91.84%
    Req/Sec    12.46k     2.04k   16.87k    55.68%
  Latency Distribution
     50%       0.34 ms
     75%       0.40 ms
     90%       0.64 ms
     99%       3.19 ms
  2976626 requests in 60031086, 30.97GB read
Requests/sec:  49584.74
Transfer/sec:    528.35MB
Running 1m test @ http://192.168.1.4/index.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.37ms    3.45ms  63.89ms   90.13%
    Req/Sec    15.32k     2.38k   22.27k    72.02%
  Latency Distribution
     50%       1.08 ms
     75%       2.61 ms
     90%       5.75 ms
     99%      17.66 ms
  3657292 requests in 60061811, 38.06GB read
  Socket errors: connect 0, read 33527, write 0, timeout 0
Requests/sec:  60892.14
Transfer/sec:    648.84MB
Running 1m test @ http://192.168.1.4/index.html
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.94ms   14.06ms 472.61ms   96.45%
    Req/Sec    13.03k   567.77    15.67k    72.38%
  Latency Distribution
     50%       7.77 ms
     75%       8.38 ms
     90%      11.07 ms
     99%      44.17 ms
  3110495 requests in 60027651, 32.37GB read
  Socket errors: connect 0, read 236484, write 0, timeout 0
Requests/sec:  51817.70
Transfer/sec:    552.14MB
Running 1m test @ http://192.168.1.4/index.html
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   170.97ms    1.13s   28.41s    98.11%
    Req/Sec     6.30k     1.62k   12.96k    61.71%
  Latency Distribution
     50%      20.52 ms
     75%      21.91 ms
     90%     160.35 ms
     99%    2450.62 ms
  1505609 requests in 60048347, 15.67GB read
  Socket errors: connect 0, read 223, write 0, timeout 0
Requests/sec:  25073.28
Transfer/sec:    267.17MB
Running 1m test @ http://192.168.1.4/index.html
  10 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   401.26us  378.12us  11.08ms   96.88%
    Req/Sec     5.28k   328.66     6.74k    74.39%
  Latency Distribution
     50%       0.35 ms
     75%       0.39 ms
     90%       0.43 ms
     99%       2.71 ms
  2910214 requests in 60084628, 30.28GB read
  Socket errors: connect 20, read 0, write 0, timeout 0
Requests/sec:  48435.25
Transfer/sec:    516.11MB
Running 1m test @ http://192.168.1.4/index.html
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.59ms    3.76ms  52.69ms   88.72%
    Req/Sec     6.50k     0.97k   13.91k    70.40%
  Latency Distribution
     50%       0.92 ms
     75%       2.97 ms
     90%       6.96 ms
     99%      18.44 ms
  3884159 requests in 60096985, 40.42GB read
  Socket errors: connect 0, read 25981, write 0, timeout 0
Requests/sec:  64631.51
Transfer/sec:    688.68MB
Running 1m test @ http://192.168.1.4/index.html
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.20ms    3.39ms 226.68ms   98.70%
    Req/Sec     4.72k   274.98    13.43k    94.09%
  Latency Distribution
     50%      10.22 ms
     75%      10.38 ms
     90%      10.57 ms
     99%      13.95 ms
  2822716 requests in 60099384, 29.37GB read
  Socket errors: connect 0, read 79923, write 0, timeout 0
Requests/sec:  46967.47
Transfer/sec:    500.46MB
Running 1m test @ http://192.168.1.4/index.html
  10 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   454.05ms    1.81s   29.85s    95.40%
    Req/Sec     2.51k   624.85     7.84k    75.60%
  Latency Distribution
     50%      20.53 ms
     75%      21.34 ms
     90%     770.60 ms
     99%    11142.18 ms
  1499916 requests in 60042150, 15.61GB read
  Socket errors: connect 0, read 262, write 0, timeout 13
Requests/sec:  24981.05
Transfer/sec:    266.19MB
Running 1m test @ http://192.168.1.4/index.html
  20 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   288.16us   80.15us   2.99ms   77.47%
    Req/Sec     3.20k   314.41     4.25k    71.39%
  Latency Distribution
     50%       0.27 ms
     75%       0.32 ms
     90%       0.39 ms
     99%       0.56 ms
  2829111 requests in 60077490, 29.44GB read
  Socket errors: connect 20, read 0, write 0, timeout 0
Requests/sec:  47091.03
Transfer/sec:    501.78MB
Running 1m test @ http://192.168.1.4/index.html
  20 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.72ms    4.02ms  46.97ms   87.88%
    Req/Sec     3.46k   742.34     7.14k    69.45%
  Latency Distribution
     50%       0.72 ms
     75%       3.24 ms
     90%       7.77 ms
     99%      19.11 ms
  4138513 requests in 60096887, 43.06GB read
  Socket errors: connect 0, read 29112, write 0, timeout 0
Requests/sec:  68864.02
Transfer/sec:    733.78MB
Running 1m test @ http://192.168.1.4/index.html
  20 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.19ms    2.41ms 221.14ms   98.09%
    Req/Sec     2.35k   171.31    11.94k    94.57%
  Latency Distribution
     50%      10.26 ms
     75%      10.42 ms
     90%      10.62 ms
     99%      13.92 ms
  2810151 requests in 60099260, 29.24GB read
  Socket errors: connect 0, read 80647, write 0, timeout 0
Requests/sec:  46758.50
Transfer/sec:    498.23MB
Running 1m test @ http://192.168.1.4/index.html
  20 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   805.24ms    3.31s   28.93s    95.90%
    Req/Sec     1.33k   423.17     8.18k    75.07%
  Latency Distribution
     50%      19.81 ms
     75%      23.44 ms
     90%    1322.05 ms
     99%    21572.60 ms
  1595746 requests in 60091181, 16.61GB read
  Socket errors: connect 0, read 611, write 0, timeout 0
Requests/sec:  26555.41
Transfer/sec:    282.96MB